---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailIndex
source: html/c743a6e2-aedc-7320-55b2-bbc8624ec606.htm
---
# Autodesk.Revit.DB.Architecture.RailIndex

The continuous rail position index.

## Syntax (C#)
```csharp
public enum RailIndex
```